Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If the annotated method does not return `void` the arguments are optional.
ja_jp: アノテーションされたメソッドが `void` を返さない場合、引数はオプションです。

source: If the application attempts to inject a configuration property that is not set, an error is thrown.
ja_jp: アプリケーションが設定されていない設定プロパティーを注入しようとすると、エラーがスローされます。

source: If the application contains the `quarkus-info` extension, then Quarkus will by default expose the `/q/info` endpoint which provides information about the build, java version, version control, and operating system. The level of detail of the exposed information is configurable.
ja_jp: アプリケーションに `quarkus-info` のエクステンションが含まれている場合、Quarkusはデフォルトで `/q/info` のエンドポイントを公開し、ビルド、Javaバージョン、バージョン管理、オペレーティングシステムに関する情報を提供します。公開される情報の詳細レベルは、設定可能です。

source: If the assumptions the Minikube extension makes don't fit your workflow, nothing prevents you from using the regular Kubernetes extension to generate Kubernetes manifests and apply those to your Minikube cluster.
ja_jp: Minikube エクステンションが想定している前提がワークフローに合わない場合、通常の Kubernetes エクステンションを使用して Kubernetes マニフェストを生成し、それを Minikube クラスタに適用することを妨げるものは何もありません。

source: If the authentication is inclusive then `SecurityIdentity` created by the first authentication mechanism can be injected into the application code. For example, if both <<mutual-tls>> and basic authentication mechanism authentications are required, the <<mutual-tls>> mechanism will create `SecurityIdentity` first.
ja_jp: 認証が統合認証である場合、最初の認証メカニズムによって作成された `SecurityIdentity` は アプリケーションコードに挿入されます。 たとえば、<<mutual-tls>> と基本的な認証メカニズムの認証が必要な場合、<<mutual-tls>> メカニズムが最初に `SecurityIdentity` を作成します。

source: If the base `URI` is not supplied we attempt to obtain the value from the config. The key consists of the client id and the `.base-uri` suffix.
ja_jp: ベース `URI` が指定されていない場合は、設定から値を取得しようとします。キーは、クライアント ID と `.base-uri` 接尾辞で構成されます。

source: If the basic CRUD operations from the Jakarta Data interfaces are not enough, we can always add a custom one, in this case a delete operation that removes `MyEntity`s by name.
ja_jp: Jakarta Data インターフェースの基本的な CRUD 操作で不十分な場合は、いつでもカスタム操作を追加できます。この例では、名前で `MyEntity` を削除する削除操作です。

source: If the bearer access token claim `acr` does not contain `myACR`, Quarkus returns an authentication requirements challenge indicating required `acr_values`:
ja_jp: ベアラーアクセストークンのクレーム `acr` が `myACR` を含まない場合、Quarkus は必要な `acr_values` を示す認証要件チャレンジを返します:

source: If the behavior introduced in 3.18 causes issues for your workload, deactivate it by setting the `-Dquarkus-oracle-no-automatic-rollback-on-connection-close` system property to `true`. Make sure to report your use case in the link:https://github.com/quarkusio/quarkus/issues[issue tracker] so we can adjust this behavior if needed, for example, with more permanent settings.
ja_jp: 3.18 で導入された動作がワークロードに問題を引き起こす場合は、 `-Dquarkus-oracle-no-automatic-rollback-on-connection-close` システムプロパティーを `true` に設定して無効にしてください。 必要に応じてこの動作を調整できるよう (より永続的な設定など)、 link:https://github.com/quarkusio/quarkus/issues[Issue トラッカー] でユースケースを報告してください。

source: If the behavior introduced in 3.18 causes issues for your workload, disable it by setting the `-Dquarkus-oracle-no-automatic-rollback-on-connection-close` system property to `true`. Make sure to report your use case in our link:https://github.com/quarkusio/quarkus/issues[issue tracker] so we can adjust this behavior if needed, for example, with more permanent settings.
ja_jp: 3.18で導入された動作があなたのワークロードに問題を引き起こす場合、 `-Dquarkus-oracle-no-automatic-rollback-on-connection-close` システムプロパティを `true` に設定することでこの動作を無効にしてください。 必要であれば、より永続的な設定などでこの動作を調整することができます link:https://github.com/quarkusio/quarkus/issues[。]

source: If the certificate has not been loaded into a keystore, it can be provided directly using the properties listed below. Quarkus will first try to load the given files as resources, and uses the filesystem as a fallback. The certificate / key pair will be loaded into a newly created keystore on startup.
ja_jp: 証明書がキーストアにロードされていない場合は、以下のプロパティーを使用して直接提供することができます。Quarkus はまず、与えられたファイルをリソースとしてロードしようとし、ファイルシステムをフォールバックとして使用します。証明書/キーペアは、起動時に新しく作成されたキーストアにロードされます。

source: If the class cannot depend on Quarkus, then Quarkus can use any custom annotation, as long as the extension implements the `io.quarkus.deployment.recording.RecordingAnnotationsProvider` SPI.
ja_jp: クラスがQuarkusに依存できない場合、エクステンションが `io.quarkus.deployment.recording.RecordingAnnotationsProvider` SPIを実装していれば、Quarkusは任意のカスタムアノテーションを使用することができます。

source: If the class name equals to `org.acme.Bar` then add `@MyInterceptorBinding`.
ja_jp: クラス名が `org.acme.Bar` と同じ場合は、 `@MyInterceptorBinding` を追加します。

source: If the class name equals to `org.acme.Bar` then add `@MyInterceptorBinding`. Don't forget to invoke `Transformation#done()`.
ja_jp: クラス名が `org.acme.Bar` と同じ場合は、 `@MyInterceptorBinding` を追加します。 `Transformation#done()` を呼び出すことを忘れないでください。

source: If the client does not indicate its support for HTTP compression in a request header, e.g. `Accept-Encoding: deflate, gzip, br`, then the response body is not compressed.
ja_jp: クライアントがリクエストヘッダーで HTTP 圧縮のサポートを示さない場合 (例: `Accept-Encoding: deflate、gzip、br`)、レスポンスボディーは圧縮されません。

source: If the client does not support HTTP compression then the response body is not compressed.
ja_jp: クライアントが HTTP 圧縮をサポートしていない場合、レスポンスボディは圧縮されません。

source: If the compression level is not set, the compression is disabled. The compression will happen once the native executable is built and will replace the executable.
ja_jp: 圧縮レベルが設定されていない場合は、圧縮が無効になります。圧縮は、ネイティブ実行可能ファイルがビルドされた時点で行われ、実行ファイルを置き換えます。

source: If the configuration type is one of the optional types, then empty values are allowed for the configuration key; otherwise, specification of an empty value will result in a configuration error which prevents the application from starting. This is especially relevant to configuration properties of inherently emptiable values such as `List`, `Set`, and `String`. Such value types will never be empty; in the event of an empty value, an empty `Optional` is always used.
ja_jp: 設定タイプがオプションタイプの 1 つである場合は、設定キーに空の値が許可されます。それ以外の場合は、空の値を指定すると、アプリケーションの起動を妨げる設定エラーが発生します。これは、特に `List` 、 `Set` 、および `String` など、もともと空にできる値の設定プロパティーに関連します。このような値タイプは空になることはありません。空の値のイベントでは、空の `Optional` が常に使用されます。

source: If the connector cannot extract the Cloud Event metadata, it sends the Message without the metadata.
ja_jp: コネクターがクラウドイベントメタデータを抽出できない場合、コネクターはメタデータなしでメッセージを送信します。

source: If the consumer method receives a `Message`, the acknowledgment strategy is `Strategy.MANUAL` and the consumer method is in charge of ack/nack the message.
ja_jp: コンシューマーメソッドが `Message` を受信した場合、確認応答ストラテジーは `Strategy.MANUAL` で、コンシューマーメソッドがメッセージの ack/nack を行います。

source: If the container is shared between multiple applications running on different ports then you will need to register `redirect_uri` values for each of these applications.
ja_jp: コンテナーが異なるポートで実行されている複数のアプリケーション間で共有されている場合は、これらのアプリケーションごとに `redirect_uri` 値を登録する必要があります。

source: If the container is shared between multiple applications running on different ports, you must register `redirect_uri` values for each application.
ja_jp: 異なるポートで実行されている複数のアプリケーション間でコンテナーを共有する場合は、アプリケーションごとに `redirect_uri` 値を登録する必要があります。

source: If the context is needed, lead with the phrase:
ja_jp: 文脈が必要な場合は、次のフレーズで始めます。

source: If the current access token needs to be exchanged before propagation and you work with link:https://www.keycloak.org/docs/latest/securing_apps/#_token-exchange[Keycloak] or other OpenID Connect Provider which supports a link:https://tools.ietf.org/html/rfc8693[Token Exchange] token grant then you can configure `AccessTokenRequestFilter` like this:
ja_jp: もし、現在のアクセストークンを伝搬する前に交換する必要があり、かつ link:https://www.keycloak.org/docs/latest/securing_apps/#_token-exchange[Keycloak] または他の link:https://tools.ietf.org/html/rfc8693[Token Exchange] トークングラントをサポートする OpenID Connect プロバイダーで作業する場合は、 `AccessTokenRequestFilter` を以下のように設定することが可能です。

source: If the current access token needs to be exchanged before propagation and you work with link:https://www.keycloak.org/docs/latest/securing_apps/#_token-exchange[Keycloak] or other OpenID Connect Provider which supports a link:https://tools.ietf.org/html/rfc8693[Token Exchange] token grant, then you can configure `AccessTokenRequestFilter` like this:
ja_jp: 現在のアクセストークンを伝播する前に交換する必要があり、かつ link:https://www.keycloak.org/docs/latest/securing_apps/#_token-exchange[Keycloak] やその他の link:https://tools.ietf.org/html/rfc8693[Token Exchange] トークングラントをサポートする OpenID Connect Provider で作業する場合は、 `AccessTokenRequestFilter` をこのように設定することが可能です。

source: If the current access token needs to be exchanged before propagation and you work with link:https://www.keycloak.org/securing-apps/token-exchange[Keycloak] or another OpenID Connect provider that supports a link:https://tools.ietf.org/html/rfc8693[Token Exchange] token grant, you can configure `AccessTokenRequestFilter` like this:
ja_jp: 現在のアクセストークンを伝播する前に交換する必要があり、link:https://www.keycloak.org/securing-apps/token-exchange[Keycloak] または link:https://tools.ietf.org/html/rfc8693[Token Exchange] トークングラントをサポートするその他の OpenID Connect プロバイダーを使用する場合は、`AccessTokenRequestFilter` を次のように設定できます。

source: If the current access token needs to be exchanged before propagation and you work with link:https://www.keycloak.org/securing-apps/token-exchange[Keycloak] or other OpenID Connect Provider which supports a link:https://tools.ietf.org/html/rfc8693[Token Exchange] token grant, then you can configure `AccessTokenRequestFilter` like this:
ja_jp: 現在のアクセストークンを伝播前に交換する必要があり、link:https://www.keycloak.org/securing-apps/token-exchange[Keycloak] または link:https://tools.ietf.org/html/rfc8693[Token Exchange] トークングラントをサポートするその他の OpenID Connect プロバイダーを使用する場合は、 `AccessTokenRequestFilter` を次のように設定できます。

source: If the database cannot be reached, a warning will be logged but startup will proceed.
ja_jp: データベースに到達できない場合、警告が記録されますが、起動は続行されます。

source: If the database cannot be reached, a warning will be logged but startup will proceed. You can optionally disable the version check if you know the database won't be reachable on startup using <<quarkus-hibernate-orm_quarkus-hibernate-orm-database-version-check-enabled,`quarkus.hibernate-orm.database.version-check.enabled=false`>>.
ja_jp: データベースにアクセスできない場合は警告が記録されますが、起動は続行されます。 起動時にデータベースにアクセスできないことがわかっている場合は、 <<quarkus-hibernate-orm_quarkus-hibernate-orm-database-version-check-enabled,`quarkus.hibernate-orm.database.version-check.enabled=false`>> を使用して、オプションでバージョンチェックを無効化できます。

source: If the dependency contains a lot of proto files and you want to generate classes for only a subset of them, you can specify glob patterns per dependency. The path to match are relative to the path `src/main/resources` in the dependency.
ja_jp: 依存関係に多くのプロトファイルが含まれていて、その一部だけのクラスを生成したい場合は、依存関係ごとにグロブパターンを指定することができます。マッチするパスは、依存関係内のパス `src/main/resources` からの相対パスです。

source: If the dependency contains many proto files, and you want to generate classes for only a subset of them, you can specify glob patterns per dependency. The paths to match are relative to the `src/main/resources` path in the dependency. For example:
ja_jp: 依存関係に多数の proto ファイルが含まれており、それらのサブセットのみのクラスを生成する場合は、依存関係ごとに glob パターンを指定できます。 一致させるパスは、依存関係内の `src/main/resources` パスからの相対パスです。

source: If the dynamic tenant resolver returns `null`, a <<static-tenant-resolution>> is attempted next.
ja_jp: 動的テナントリゾルバーが `null` を返す場合、次に <<static-tenant-resolution>> が試行されます。

source: If the endpoint does not return a `CompletionStage`, the HTTP response may be written before the message is sent to Kafka, and so failures won't be reported to the user.
ja_jp: エンドポイントが `CompletionStage` を返さない場合、メッセージが Kafka に送信される前に HTTP 応答が書き込まれる可能性があるため、ユーザーに失敗が報告されることはありません。

source: If the endpoint is running on `http://localhost:8080`, you can also provide UI options for users to log in to either `http://localhost:8080/google` or `http://localhost:8080/github`, without having to add specific `/google` or `/github` JAX-RS resource paths.
ja_jp: エンドポイントが `http://localhost:8080` で実行されている場合は、特定の `/google` または `/github` JAX-RS リソースパスを追加せずに、ユーザーが `http://localhost:8080/google` または `http://localhost:8080/github` のいずれかにログインするための UI オプションを提供することもできます。

source: If the endpoint is running on `http://localhost:8080`, you can also provide UI options for users to log in to either `http://localhost:8080/google` or `http://localhost:8080/github`, without having to add specific `/google` or `/github` JAX-RS resource paths. Tenant identifiers are also recorded in the session cookie names after the authentication is completed. Therefore, authenticated users can access the secured application area without requiring either the `google` or `github` path values to be included in the secured URL.
ja_jp: エンドポイントが `http://localhost:8080` で実行されている場合は、特定の `/google` または `/github` JAX-RS リソースパスを追加せずに、ユーザーが `http://localhost:8080/google` または `http://localhost:8080/github` のいずれかにログインするための UI オプションを提供することもできます。 認証が完了すると、テナント識別子もセッション Cookie 名に記録されます。 したがって、認証されたユーザーは、セキュアな URL に `google` または `github` パス値を含める必要なく、セキュアなアプリケーション領域にアクセスできます。

source: If the entities come from external projects or jars, you can make sure that your jar is treated like a Quarkus application library by adding an empty `META-INF/beans.xml` file.
ja_jp: エンティティーが外部のプロジェクトやジャーから来ている場合は、空の `META-INF/beans.xml` ファイルを追加することで、jarがQuarkusアプリケーションライブラリのように扱われるようにすることができます。

source: If the entry is missing, it could be that some call path is being filtered that maybe shouldn’t have been. To verify that, inspect the contents of `target/quarkus-caller-filter.json` and `target/quarkus-access-filter.json` files, and confirm that the class and/or package making the call or being accessed is not being filtered out.
ja_jp: エントリーが見つからない場合、フィルタリングされるべきではない呼び出しパスがフィルタリングされてしまった可能性があります。 確認するには、 `target/quarkus-caller-filter.json` ファイルと`target/quarkus-access-filter.json` ファイルの内容を検査します。 呼び出しているクラスやパッケージ、またはアクセスされているクラスやパッケージがフィルタリングされていないことを確認します。

source: If the error occurs then log into Keycloak using the `Keycloak Admin` option and update the realm configuration as necesary and also check the `application.properties`.
ja_jp: エラーが発生した場合は、 `Keycloak Admin` オプションを使用して Keycloak にログインし、必要に応じてレルム設定を更新し、 `application.properties` も確認します。

source: If the error occurs then log into Keycloak using the `Keycloak Admin` option and update the realm configuration as necessary and also check the `application.properties`.
ja_jp: エラーが発生した場合は、 `Keycloak Admin` オプションを使用して Keycloak にログインし、必要に応じてレルム設定を更新し、 `application.properties` も確認します。

source: If the error occurs, log in to Keycloak by using the *Keycloak Admin* option, update the realm configuration as necessary, and check the `application.properties`.
ja_jp: エラーが発生した場合は、*Keycloak Admin* オプションを使用して Keycloak にログインし、必要に応じてレルム設定を更新し、`application.properties` を確認してください。

source: If the extension provides additional Config Sources and if these are required during Static Init, these must be registered with `StaticInitConfigBuilderBuildItem`. Configuration in Static Init does not scan for additional sources to avoid double initialization at application startup time.
ja_jp: エクステンションが追加の設定ソースを提供し、それらが Static Init 中に必要な場合は、それらを `StaticInitConfigSourceProviderBuildItem` に登録する必要があります。Static Init での設定は、アプリケーション起動時の二重の初期化を避けるため、追加のソースをスキャンしません。

source: If the extension provides additional Config Sources and if these are required during Static Init, these must be registered with `StaticInitConfigSourceProviderBuildItem`. Configuration in Static Init does not scan for additional sources to avoid double initialization at application startup time.
ja_jp: エクステンションが追加のコンフィグソースを提供し、それらがスタティック初期化中に必要な場合は、それらを `StaticInitConfigSourceProviderBuildItem` に登録する必要があります。スタティック初期化での設定は、アプリケーション起動時の二重の初期化を避けるため、追加のソースをスキャンしません。

source: If the extension provides some web resources, add the `base/src/main/resources/META-INF/resources/index.entry.qute.html` template (<<index-html>>).
ja_jp: エクステンションが Web リソースを提供する場合は、 `base/src/main/resources/META-INF/resources/index.entry.qute.html` テンプレート (<<index-html>>) を追加します。

source: If the extension provides some web resources, add the `base/src/main/resources/META-INF/resources/index.entry.qute.html` template (xref:index-html[index.html and web extension codestarts]).
ja_jp: エクステンションがいくつかのウェブリソースを提供する場合、 `base/src/main/resources/META-INF/resources/index.entry.qute.html` テンプレート ( xref:index-html[index.html とウェブエクステンションのcodestart] ) を追加します。

source: If the filter is enabled and an HTTP request is identified as cross-origin, the CORS policy and headers defined using the following properties will be applied before passing the request on to its actual target (servlet, JAX-RS resource, etc.):
ja_jp: フィルターが有効になっていて、HTTP 要求がクロスオリジンであると識別された場合は、要求を実際のターゲット (サーブレット、JAX-RS リソースなど) に渡す前に、以下のプロパティーを使用して定義された CORS ポリシーとヘッダーが適用されます。

source: If the filter is enabled and an HTTP request is identified as cross-origin, the CORS policy and headers defined using the following properties will be applied before passing the request on to its actual target (servlet, Jakarta REST resource, etc.):
ja_jp: フィルターが有効で、HTTPリクエストがクロスオリジンとして識別された場合、リクエストを実際のターゲット（サーブレット、Jakarta RESTリソースなど）に渡す前に、以下のプロパティで定義されたCORSポリシーとヘッダーが適用されます:

source: If the first sentence is too long or cannot be simplified to fit on the website tile, you can define a ``:summary:`` attribute in the document header attributes to serve that purpose. For more information, see <<doc-header-optional>>.
ja_jp: 最初の文が長すぎる場合、または Web サイトのタイルに収まらないほど簡略化できない場合は、ドキュメントヘッダー属性に ``:summary:`` 属性を定義して、その目的を果たすことができます。 詳細は、<<doc-header-optional>> を参照してください。

source: If the following configuration is created in the the `application.properties` file, only logs with a level of `ERROR` or higher will be exported:
ja_jp: `application.properties` ファイルに以下の設定が作成されている場合、`ERROR` レベル以上のログのみがエクスポートされます。

source: If the generated native image agent configuration is not satisfactory, more information can be obtained using any of the following techniques:
ja_jp: 生成されたネイティブイメージエージェントの設定が十分でない場合、次のいずれかの手法を使用すると、さらに詳しい情報を取得できます。

source: If the goal is to only mock certain configuration values and retain the original configuration, the mocking instance requires a spy:
ja_jp: 特定の設定値のみをモックし、元の設定を保持することが目的の場合、モックインスタンスにはスパイが必要となります。

source: If the guide includes an `application.properties` example, a tip must be included just below the code snippet:
ja_jp: ガイドに `application.properties` の例が含まれている場合、コードスニペットのすぐ下にヒントを記載する必要があります:

source: If the injected token needs to have its `iss` (issuer) and/or `aud` (audience) claims updated and secured again with a new signature then you can configure `JsonWebTokenRequestFilter` like this:
ja_jp: 注入されたトークンの `iss` (発行者) や `aud` (オーディエンス) のクレームを更新して、新しい署名で保護する必要がある場合は、 `JsonWebTokenRequestFilter` を以下のように設定できます。

source: If the injected token needs to have its `iss` (issuer) or `aud` (audience) claims updated and secured again with a new signature, then you can configure `JsonWebTokenRequestFilter` like this:
ja_jp: 注入されたトークンの `iss` (issuer) や `aud` (audience) のクレームを更新して、新しい署名で保護する必要がある場合は、次のように `JsonWebTokenRequestFilter` を設定できます。

source: If the item produced by the route does not pass the validation, it returns a HTTP 500 response. If the request accepts JSON payload, the response follows the https://opensource.zalando.com/problem/constraint-violation/[Problem] format.
ja_jp: ルートによって生成されたアイテムがバリデーションに合格しない場合、HTTP 500 レスポンスを返します。リクエストが JSON ペイロードを受け入れる場合、レスポンスは https://opensource.zalando.com/problem/constraint-violation/[問題] のとおりの形式になります。

source: If the item produced by the route does not pass the validation, it returns an HTTP 500 response. If the request accepts JSON payload, the response follows the https://opensource.zalando.com/problem/constraint-violation/[Problem] format.
ja_jp: ルートによって生成されたアイテムがバリデーションを通過しない場合、HTTP 500 レスポンスが返されます。リクエストが JSON ペイロードを受け入れる場合、レスポンスは https://opensource.zalando.com/problem/constraint-violation/[問題] のとおりの形式になります。

source: If the key does not exist in the current locale, the fallback text ('Fetching data sources...') is used automatically.
ja_jp: キーが現在のロケールに存在しない場合、フォールバックテキスト ('Fetching data sources...') が自動的に使用されます。

source: If the library directly uses a metrics API, there are two options:
ja_jp: ライブラリーがメトリクス API を直接使用する場合、2 つのオプションがあります。

source: If the limit is not exceeded, or if priority load shedding determines that the request should not be rejected (see below), the request is allowed. When it finishes, its duration is compared with the lowest duration seen so far to estimate a queue size. If the queue size is lower than _alpha_, the current limit is increased, but only up to a given maximum, by default 1000. If the queue size is greater than _beta_, the current limit is decreased. Otherwise, the current limit is kept intact.
ja_jp: 制限を超えていない場合、または優先負荷制限によりリクエストを拒否する必要がないと判断された場合 (以下を参照)、リクエストは許可されます。 完了すると、その処理時間がこれまでの最短時間と比較され、キューサイズの推定に使用されます。 キューサイズが _alpha_ より小さい場合、現在の制限は増加しますが、指定された最大値 (デフォルトでは 1000) までしか増加されません。 キューサイズが _beta_ を超える場合、現在の制限は減少します。 それ以外の場合、現在の制限は維持されます。

source: If the list of extensions does not match the tool you are using (e.g. Docker Desktop, microk8s etc) then it is suggested to use the `quarkus-minikube` extension. as its defaults should be reasonable for most environments.
ja_jp: エクステンションのリストが使用しているツール（例：Docker Desktop、microk8sなど）と一致しない場合は、 `quarkus-minikube` のエクステンションを使用することをお勧めします。 そのデフォルト値は殆どの環境で妥当なためです。

source: If the management interface is enabled, the endpoint will be exposed on: `http://0.0.0.0:9000/q/my-path`. Otherwise, it will be exposed on: `http://localhost:8080/q/my-path`.
ja_jp: マネジメントインタフェースが有効な場合、エンドポイントは `http://0.0.0.0:9000/q/my-path` で公開されます: 無効の場合は、`http://localhost:8080/q/my-path` で公開されます。

source: If the member name is represented as a getter, the member name is taken from its property name equivalent, and then converted to its kebab-case format.
ja_jp: メンバー名がゲッターとして表現されている場合、メンバー名はそのプロパティー名に相当するものから取得され、ケバブケース形式に変換されます。

source: If the mentioned option is added by a third party library like in the example above, you should consider opening an issue in the library's repository to ask for the option to be removed. If the option is added by your application, you should consider either removing it (if it's not necessary) or wrapping it between `-H:+UnlockExperimentalVMOptions` and `-H:-UnlockExperimentalVMOptions`.
ja_jp: 上記の例のように、言及されたオプションがサードパーティーのライブラリーで追加された場合は、ライブラリーのリポジトリーで問題を起票して、オプションを削除するように依頼することを検討する必要があります。 アプリケーションによってオプションが追加された場合は、そのオプションを削除するか (必要でない場合)、 `-H:+UnlockExperimentalVMOptions` と `-H:-UnlockExperimentalVMOptions` の間にラップすることを検討する必要があります。

source: If the message payload cannot be serialized to JSON, the message is _nacked_.
ja_jp: メッセージペイロードを JSON にシリアライズできない場合、メッセージは _nack_ されます。

source: If the message processing is asynchronous (offloaded to another thread, use non-blocking I/O...), failures may not interrupt the while loop from above. Failure happens asynchronously, outside the polling thread. If the `poll` method gets called again despite a failed processing, and _auto-commit_ is still enabled, we may commit offsets while something wrong happened. If some processing of previously retrieved records is not completed yet, while this auto commit happens, it may consider the record as processed correctly, but the outcome is unknown at that point.
ja_jp: メッセージ処理が非同期(他のスレッドにオフロードされている、ノンブロッキングI/Oを使用している...)であれば、失敗は上からwhileループを中断しないかもしれません。失敗はポーリングスレッドの外で非同期に起こります。処理に失敗したにもかかわらず `poll` メソッドが再び呼び出され、 _オートコミット_ がまだ有効になっている場合、何か間違ったことが起こっている間にオフセットをコミットすることがあります。このオートコミットが発生している間に、以前に取得したレコードの処理がまだ完了していない場合、そのレコードは正しく処理されたとみなされるかもしれませんが、その時点では結果はわかりません。

source: If the method does not declare any of the annotations listed above the execution model is derived from the return type:
ja_jp: メソッドが上記のアノテーションのいずれも宣言していない場合、実行モデルは戻り値の型から派生します。
